{
  "basics": {
    "name": "Alan Ning",
    "label": "Software Engineer",
    "email": "askldjd@gmail.com",
    "phone": "(808) 232-7868",
    "website": "https://www.askldjd.com",
    "location": {
      "address": "",
      "postalCode": "20171",
      "city": "Herndon",
      "countryCode": "US",
      "region": "Virginia"
    },

    "profiles": [{
      "url": "http://www.askldjd.com",
      "network": "Personal Blog"
    }, {
      "url": "https://github.com/askldjd",
      "network": "Github Profile"
    }]
  },
  "work": [{
    "company": "United States Digital Service - Department of Veterans Affairs",
    "position": "Digital Specialist",
    "website": "https://www.usds.gov",
    "picture": "",
    "startDate": "2016-09-21",
    "summary": "Site Reliability Engineer for Caseflow, an open source effort to streamline the Veterans Appeals Case Processing System.",
    "highlights": [
      "Oversee daily application deployments and ensure system reliability and scalability in a high stress environment.",
      "Built and maintained a self healing infrastructure in the AWS Govcloud environment using Ansible and Terraform.",      
      "Developed and provisioned monitoring infrastructure using Prometheus, Grafana and Sentry.",
      "Migrated a 30 year old Oracle database that holds all Veterans Appeals to the cloud using AWS DMS.",
      "Troubleshoot highly complex networking issues in multiple networking layers (2-7).",
      "Built a CI/CD pipeline with Github/Jenkins/Slack to maximize team velocity.",
      "Help set up AWS Direct Connect with VA on-premise network, and migrate VA's infrastructure to the cloud",
      "Automate my job away."
    ]
  }, {
    "company": "United States Digital Service - Social Security Adminstration",
    "position": "Digital Specialist",
    "website": "https://www.usds.gov",
    "picture": "",
    "startDate": "2015-11-07",
    "endDate": "2016-09-20",
    "summary": "Technical Lead on Disability Case Processing System (DCPS), a modern nation-wide SSA disability case processing system.",
    "highlights": [
      "Led and developed a disability case processing system with a modern microservice architecture. The overall system is very large because of the complex business process, as well as the integration with numerous legacy mainframe systems.",
      "The core product is an HTML5 Single-Page Application based on a variant of the MEAN stack (ReactJS, Node/Express, and Postgres). Numerous technologies are deployed to support server side development.",
      "Elasticsearch is used to support dashboard-type summary through Aggregation API and text searches through Search API.",
      "Redis is used to support microservice session storage, as well as integrations with legacy SSA services.",
      "Zookeeper is used to provide global locks in the distributed environment.",
      "Docker is used to wrap each microservice into isolated container. The cloud deployment is provisioned by Openshift/Kubernetes over AWS. "
    ]
  }, {
    "company": "Boeing / Digital Receiver Technology",
    "position": "Technical Lead Engineer (Leave of Absence)",
    "website": "http://www.drti.com",
    "picture": "",
    "startDate": "2005-06-15",
    "endDate": "2015-10-31",
    "summary": "Developed in a full stack environment that encompasses high performance embedded C++ applications, backend Java web services, and high level frontend development using the MEAN stack.",
    "highlights": [
      "(2014-15) Led and developed a modern web frontend for an embedded system. The UI frontend framework uses Angular.js and React.js. The layout is responsive and heavily influenced by Google's Material Design guidelines. The REST backend is developed in Node.js with Hapi and a LevelDB NoSQL database. The backend is heavily optimized for an embedded environment and can scale from under 50MB to 16GB of memory.",
      "(2013-14) Led cyber security research on routing raw IP frames from the Linux kernel to a mobile device. IP table and ARP cache customization concepts were discovered that fooled the kernel into performing the routing. The research became part of the DRT software product line.",
      "(2014) Led research on a packet decryption solution using AWS High Performance Computing (HPC). A prototype was implemented using NVIDIA GPU CUDA framework, and resulted in over 10x speedup compare to a traditional CPU based decryption.",
      "(2013) Led research to integrate the DRT receiver output with Hadoop and Cassandra along with Elasticsearch and Kibana dashboard. Hundreds of GB of event logs were archived, indexed, and analyzed. The end result was well received in the annual symposium.",
      "(2012) Led and developed an Android application that communicates with a high performance spectrum scanner. The application was developed using Eclipse, targeted Android 4.x, and was backward compatible with Android 2.3. The software can be seen on the company homepage.",
      "(2011) Led and developed numerous SOAP based web services in Java. AXIS2 and Tomcat were the primary technology tools in the stack.",
      "(2010) Personally developed a performance profiling tool in C++ and C# to profile an embedded Windows application. The Windows Performance Counter API were consumed through C++ while the data is plotted using C# Zedgraph.",
      "(2008-11) Developed a high performance spectrum scanner in C++. Heavy CPU and currency optimizations were performed on the energy detection output through Boost ASIO framework."
    ]
  }],
  "education": [{
    "institution": "Johns Hopkins University",
    "area": "Computer Science",
    "studyType": "Master",
    "startDate": "2005-09-01",
    "endDate": "2007-06-01"
  }, {
    "institution": "Rensselaer Polytechnic Institute",
    "area": "Computer Science / Economics (Summa Cum Laude)",
    "studyType": "Bachelor",
    "startDate": "2001-09-01",
    "endDate": "2005-05-01"
  }],
  "awards": [{
    "title": "Engineer of the Year",
    "awarder": "Boeing",
    "date": "2012-12-01",
    "summary": "Engineer of the Year in 2014 (Nominated)"
  }, {
    "title": "Engineer of the Year",
    "awarder": "DRTi",
    "date": "2012-12-01",
    "summary": "Engineer of the Year in 2012"
  }],
  "skills": [{
    "name": "Front-end Development",
    "keywords": [
      "HTML5",
      "D3",
      "LESS/SCSS",
      "AngularJS",
      "React"
    ]
  }, {
    "name": "Server Side Development",
    "keywords": [
      "Node.js",
      "Express.js",
      "Hapi.js",
      "Java",
      "C#",
      "RethinkDB",
      "Redis",
      "Elasticsearch",
      "Zookeeper",
      "Ruby on Rails"
    ]
  }, {
    "name": "Cloud Development",
    "keywords": [
      "Docker",
      "Openshift",
      "Kubernetes",
      "AWS",
      "Ansible",
      "Terraform"
    ]
  }, {
    "name": "High Performance Embedded Development",
    "keywords": [
      "Modern C++",
      "C"
    ]
  }, {
    "name": "Mobile Development",
    "keywords": [
      "Android"
    ]
  }]
}
